brew "ack"
brew "autojump"
brew "bash"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "ccls"
brew "cheat"
brew "cmake"
brew "protobuf"
brew "protoc-gen-go"
brew "graphviz"
brew "fish"
brew "fzf"
brew "git-flow-avh"
brew "node@12"
brew "python"
brew "ranger"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "wget"
brew "neovim", args: ["HEAD"]
brew "shellcheck"
brew "vault"
brew "ssh-vault"

cask "skim"
cask "alacritty"
cask "v2rayx", restart_service: true
cask "google-chrome"
cask "homebrew/cask-versions/google-chrome-canary"
cask "iterm2"
